Revit 2027 API
AddInCommandBinding.RevitCommandId Property
The Revit command Id.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RevitCommandId RevitCommandId { get; }
Public ReadOnly Property RevitCommandId As RevitCommandId
	Get
public:
property RevitCommandId^ RevitCommandId {
	RevitCommandId^ get ();
}
member RevitCommandId : RevitCommandId with get
Property Value
RevitCommandId
See Also
Reference
AddInCommandBinding Class
Autodesk.Revit.UI Namespace